app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @q = Product.ransack(params[:q])
    @products = @q.result.order(:name).page(params[:page]).per(20)